[
  {
    "url": "https://foodmandu.com/",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://foodmandu.com/Home/About",
    "content": [
      "Foodmandu is the first company in Nepal that delivers food from hundreds of popular restaurants. As a pioneer food delivery service provider, we are making life easier through online ordering. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. You can get anything from Indian food to high French cuisine by placing a simple order online through our website, mobile app or over the phone. Then just sit back, relax, and wait for your order to arrive. Foodmandu Pvt. Ltd. Business: Delivery of food, grocery and daily essentials Registered Authority: Office of Company Registrar Registration Certificate Number: 71876/066/067 VAT/PAN Registration Number: 304326017 Office Locations Registered Office: Kathmandu Metropolitan City, Ward No. 4 Head Office: Tangal, Kathmandu, Nepal Branches/Outlets: Pokhara, Bharatpur, Butwal. Contact Information Email: info@foodmandu.com Phone: 5970477, 4544177, 4540979, 9802034008 Social Media: Facebook Instagram Twitter Tiktok Complaint Handling Contact Person/Unit: Customer Care Department Email: support@foodmandu.com Telephone: 5970477,4544177",
      "Foodmandu is the first company in Nepal that delivers food from hundreds of popular restaurants. As a pioneer food delivery service provider, we are making life easier through online ordering. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. You can get anything from Indian food to high French cuisine by placing a simple order online through our website, mobile app or over the phone. Then just sit back, relax, and wait for your order to arrive.",
      "Foodmandu Pvt. Ltd. Business: Delivery of food, grocery and daily essentials Registered Authority: Office of Company Registrar Registration Certificate Number: 71876/066/067 VAT/PAN Registration Number: 304326017 Office Locations Registered Office: Kathmandu Metropolitan City, Ward No. 4 Head Office: Tangal, Kathmandu, Nepal Branches/Outlets: Pokhara, Bharatpur, Butwal.",
      "Contact Information Email: info@foodmandu.com Phone: 5970477, 4544177, 4540979, 9802034008 Social Media: Facebook Instagram Twitter Tiktok Complaint Handling Contact Person/Unit: Customer Care Department Email: support@foodmandu.com Telephone: 5970477,4544177"
    ]
  },
  {
    "url": "https://foodmandu.com/Home/AvailableAreas",
    "content": [
      "Foodmandu offers food delivery services in following areas at the moment. We will continue expanding our service areas regularly. Please check this page later if your area is not available already. Anamnagar Babarmahal Bagbazar Balkhu Balkumari Baluwatar Bansbari Basantapur Basundhara Battispputali Bhaisepati Bhatbhateni Bishalnagar Boudha Chabahil Charkhal Chauni Chhetrapati Dhapashi Dhobighat Dhumbarahi Dillibazar Durbar Marg Ekantakuna Gairidhara Gaushala Golfutar Gongabu Gyaneshwor Hadigaun Hattigauda Hattisar Indrachowk Jamal Jawalakhel Jhamsikhel Jyatha Kalanki Kalikasthan Kalimati Kamal Pokhari Kamaladi Kantipath Koteshwor Kuleswor Kumaripati Kupondole Lainchaur Lazimpat Mahabaudha Maharajgunj Chakrapath Maharajgunj Talimkendra Maitidevi Maitighar Mali Gaun Mangalbazar Minbhawan Mitra Park Nag Pokhari Naxal Naya Bazar New Baneswor New Road Old Baneswor Paknajol Pani Pokhari Patan Dhoka Pulchowk Putalisadak Rani Pokhari Ratnapark Samakhusi Sanepa Sano Gaucharan Sat Dobato Sifal Sinamangal Singha Durbar Sitapaila Sohra Khutte Solti Mode Soyambhu SukeDhara Sundhara Tahachal Tangal Teku Thamel Thapathali Tripureshwor"
    ]
  },
  {
    "url": "https://foodmandu.com/Home/DeliveryCharge",
    "content": [
      "Foodmandu Fresh Orders: Rs. 100 per order Restaurants and other stores The delivery charge is calculated based on the restaurant bill total and the approximate road distance between the selected restaurant and the delivery location. Up to 1 Km: Rs. 20 After 1 Km: Additional Rs. 20/km"
    ]
  },
  {
    "url": "https://foodmandu.com/page/payment-options",
    "content": [
      "Ops! Something went wrong. Our supporting staff has been notified with this error and will address this issue shortly. We profusely apologize for the inconvenience. Please check back later."
    ]
  },
  {
    "url": "https://foodmandu.com/Home/HowToOrder",
    "content": [
      "Ordering food using our service is very easy! Follow the steps mentioned below to place your order with us. Step 1: Find a restaurant of your choice from here. There are hundreds of popular restaurants to choose from. Step 2: Select the foods of your choice from the selected restaurant's menu. The menu and price listed on our website is exactly the same as the restaurant's table menu. Step 3: Fill up the delivery details i.e. your detailed address, date and time for delivery and confirm your order. We’ll deliver your order at your place, and you’ll pay us in cash upon delivery. OR, Alternatively, you may place your orders with us over phone at 4444177 or 9802034008 in our delivery hours."
    ]
  },
  {
    "url": "https://foodmandu.com/Home/Faqs",
    "content": []
  },
  {
    "url": "https://foodmandu.com/Contact",
    "content": [
      "Page Not Found Please check back later."
    ]
  },
  {
    "url": "https://foodmandu.com/Home/TermsOfUse",
    "content": [
      "Welcome to our website. If you continue to browse and use this website, you are agreeing to comply with and be bound by the following terms and conditions of use, which together with our privacy policy govern Foodmandu’s relationship with you in relation to this website. If you disagree with any part of these terms and conditions, please do not use our website. The term ‘Foodmandu.com’ or ‘us’ or ‘we’ refers to the owner of this website. The term ‘you’ or 'our customers' or 'website users' refer to the user or viewer of our website. GENERAL Foodmandu.com is owned and operated by Foodmandu Pvt. Ltd. Our services are limited to provide restaurant food ordering and delivery service to our customers. We are in no way responsible for the quality of foods and its packaging offered by its merchant members. Please note that in our sole discretion at any time and with or without notice, we may offer any kind of incentives or promotions, shorten or extend the duration of any incentive or promotion program and/or terminate or modify any incentive or promotion program. PRICES & OTHER INFORMATION The information regarding price, product specifications and availability contained on the Site has been provided by member merchants. The prices charged by the member merchants on this website are generally the same as the prices charged in their physical stores/restaurants at the time an order is delivered, shipped or available for pickup. Although Foodmandu attempts to make certain that the prices listed on the Site and those posted in the stores on the date they are viewed on the Site are the same, and that out-of-stock items are clearly marked or removed from the inventory, prices and product availability may change, particularly if you select a delivery or pickup date that is different from the date on which you place your order. Moreover, though every effort is made to ensure accuracy in posting pricing information, discrepancies do occur. In the event that the restaurant/store price and the price posted on the Site are different, the restaurant/store price will prevail in every case. While Foodmandu has undertaken to confirm the accuracy of the information contained on this Site, mistakes can be made, due both to inaccurate reporting of accurate information and accurately reporting inaccurate information. Of course, if you become aware that the Site contains inaccurate information, please let us know by contacting us. ORDERING AND PAYMENT All ordering is performed online or via telephone. Buyers are usually billed directly by merchant members for their orders, and \"Foodmandu\" will be the name that appears on the bills you receive from the merchants. But Foodmandu may provide you separate delivery slip and redemption slips in case there is any delivery charges or cash back offer. Foodmandu shall not in any manner be considered the seller of the food. You need to pay for the ordered food in advance in Cash to us or at the time of delivery to our delivery staff. There is no online payment facilities provides till date. REFUND POLICY Foodmandu takes customer satisfaction very seriously. In the case of problems with your food order, please contact us. In appropriate cases, Foodmandu will issue full or partial refunds. For example: if you did not receive your order or received an incorrect order, you may be issued a full refund; if part of your order is missing, we may issue a partial refund. In every event, we will do our best to ensure your satisfaction. PROPERTY RIGHTS IN THE SITE AND CONTENT; INFORMATIONAL PURPOSES AND COMPLIANCE WITH LAW The Site and the Content are our property and are protected by applicable copyright, patent, trademark and other intellectual property laws. Except as expressly authorized herein, you may not reproduce, transmit, sell, display, distribute, publish, broadcast, circulate, modify, disseminate or commercially exploit the Site or the Content in any manner (including electronic, print or other media now known or hereafter developed) without our written consent. Use of the Site or the Content in violation of these Terms of Use, or any applicable law, rule or regulation (whether of Nepal or other countries), or the rights of any third party is prohibited. You agree not to use the Site or the Content for any unlawful purposes and comply with any and all requests from us to protect our respective rights in the Site and the Content. You may use the Site and the Content only for your personal use. You may download the Content to your computer and print out a hard copy for your reference and internal use and display, but you will not remove any copyright or other notices contained in the Content. We expressly prohibit the use of devices (including software) designed to provide repeated automated access to the Site and the Content for any commercial purpose except for those expressly authorized by us. We reserve the right to take any and all measures necessary to prevent such access, including denial or termination of your access to the Site. If you have any questions about any materials posted on the Site, we urge you contact your Foodmandu.com representative. NON-FOODMANDU CONTENT; PRODUCTS AND SERVICES MENTIONED ON THE SITE We neither endorse nor are responsible for the accuracy or reliability of any opinion, advice or statement made on the Site by anyone other than authorized Foodmandu.com employee spokespersons while acting in their official capacities. We do not review and assume no responsibility for any content received from, or created by, any third parties. Furthermore, we do not review and assume no responsibility for any products or services mentioned on the Site, whether provided by Foodmandu.com, affiliated companies or unaffiliated third parties. You agree to make your own independent evaluation of the products and services mentioned on the Site, including their quality. NO OBLIGATION TO KEEP INFORMATION CURRENT We are not under any obligation to update the Content to reflect circumstances that may occur after its initial publication date. Due to legal restrictions or other reasons, we may not update any Content including to take into account material changes or new information. USER CODES In connection with your use of or access to the Site, we from time to time may provide you with user names, passwords and/or other unique identifiers (User Codes). You are responsible for security and confidentiality of the User Codes and agree not to disclose them to any third party, including, if you are accessing the Site on behalf of any company or organization, any other employee in your company or organization. You are responsible for any and all information provided and any and all acts and/or omissions that occur while User Codes are being used. We are not responsible for any breach of security caused by your failure to maintain the confidentiality and security of any of the User Codes. You agree to notify us immediately in the event of loss, theft or disclosure of any or all of the User Codes, if you believe the confidentiality or security of any or all of the User Codes has been compromised in any way or in the event of your learning about a possible or actual unauthorized access to and/or use of the Site. We reserve the right to revoke or modify the User Codes at any time without prior notice. CONSENT TO RECORDING AND MONITORING You consent to our recording, retention and use of all information and data that you input or otherwise communicate during your access to and/or use of the Site or through any e-mail to or from us and any other electronic communication means and the transmittal of the same to our affiliates, subsidiaries, branches and third parties for order and other processing, database maintenance, record keeping or any other use in accordance with customary practices, policies and procedures applicable in Nepal and, of course, our privacy policies. In addition, we may disclose such information to the extent that we determine in good faith to be required by any applicable laws, rules or regulations or order or in enforcement of our rights or the defense of claims. We expressly reserve the right to monitor any and all use of the Site. CONSENT TO RECORDING OF TELEPHONE CALLS You acknowledge that from time to time, we may record certain telephone calls used for the customer service and/or related purposes, and to the extent that any such recording occurs involving you, you consent to such recording. LIMITATIONS OF LIABILITY IN NO EVENT SHALL FOODMANDU OR ITS DIRECTORS, MEMBERS, EMPLOYEES, OR AGENTS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL OR PUNITIVE DAMAGES, INCLUDING LOST PROFIT DAMAGES ARISING FROM YOUR USE OF THE WEBSITE OR FOODMANDU SERVICES, EVEN IF FOODMANDU HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. NOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, FOODMANDU'S LIABILITY TO YOU FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE FORM OF THE ACTION, WILL AT ALL TIMES BE LIMITED TO THE AMOUNT PAID, IF ANY, BY YOU TO FOODMANDU FOR FOODMANDU SERVICES DURING THE PERIOD OF 1 MONTH PRIOR TO ANY CAUSE OF ACTION ARISING"
    ]
  },
  {
    "url": "https://foodmandu.com/Home/PrivacyPolicy",
    "content": [
      "Foodmandu Pvt. Ltd. operates the ‘Foodmandu’ app (both in Google Play Store and Apple App Store) and it's website, which provides the service. This page is used to inform app and website users regarding our policies with the collection, use, and disclosure of Personal Information if anyone decided to use our service. If you choose to use our service, then you agree to the collection and use of information in relation with this policy. The personal information that we collect are used for providing and improving the service. We will not use or share your information with anyone except as described in this Privacy Policy. The terms used in this Privacy Policy have the same meanings as in our Terms of Use, which is accessible at our Terms of Use page, unless otherwise defined in this Privacy Policy. Information Collection and Use We may require you to provide us with certain personally identifiable information, including but not limited to your name, phone number, email, postal address, your GPS location, profile pictures. The information we collect are used to contact or identify you, process the orders placed with the participating merchants and is shared as needed to process the orders. We may use the user's e-mail address to convey occasional newsletters and updates regarding new participating merchants, specials offers on our platforms and other useful information related to our service. We also log and store users' IP addresses, cookie information and the information about the users' website experience, preferences and the pages they request. You can request to delete your personal information and registered account if you wish to do so by writing to us at support@foodmandu.com and our customer support staffs will guide you through the process. Log Data We want to inform you that whenever you use our app or website, we collect information that app sends to us that is called Log Data. This Log Data may include information such as your computer’s Internet Protocol (“IP”) address, app version, screens of our service that you access, the time and date of your access, the time spent on those screens, and other statistics Service Providers We may employ third-party companies and individuals due to the following reasons: To facilitate our service; To provide the service on our behalf; To perform service-related services; or To assist us in analyzing how our service is used. We want to inform our service users that in certain situations, we may need to give access to your Personal Information to these third parties. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose. Security We value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the Internet, or method of electronic storage is 100% secure and reliable, and we cannot guarantee its absolute security. Links to Other Sites Our service may contain links to other sites/apps. If you click on a third-party link, you will be directed to that site/app. Note that we do not operate these external sites/apps. Therefore, we strongly advise you to review the Privacy Policy of these websites and apps. We have no control over, and assume no responsibility for the content, privacy policies, or practices of any third-party sites, apps or services. Changes to This Privacy Policy We may update our Privacy Policy from time to time. Thus, we advise you to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately, after they are posted on this page. Contact Us If you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us."
    ]
  },
  {
    "url": "https://blog.foodmandu.com/",
    "content": [
      "Food Trend/ Restro-tales The Tales of Newari Taste Restro-tales Organic and Healthy Thai Food Restaurant in Kathmandu Online Food Festival Take a trip around the world with Foodmandu Online Food Festival 2020",
      "Food Trend Drenched in Flavor: Wholesome Foods for the Monsoon August 17, 2023 (Last Updated: August 18, 2023) As the pitter-patter of raindrops creates a soothing rhythm outside your window, it’s a sign to indulge in the joy of the monsoon season. While the rains bring a refreshing change, they also bring along a craving for warm and cozy meals that perfectly complement the ambiance. I’m aware that the rainy season doesn’t bring favorable conditions for everyone. It introduces various challenges and hazards during our commute to work, often making it hard to go about our usual routines. However, amidst these difficulties, certain foods can remarkably uplift our spirits and contribute to our well-being during this time. These monsoon delights not only have the power to brighten our mood but also to keep us in good health throughout this season. Whether you’re staying indoors or venturing out to savor the rainy weather, knowing the right foods to enjoy during the monsoon can enhance your overall experience. In this blog post, we’ll explore the top comfort food picks that keep you feeling cozy during this enchanting time of the year. Delightful Warm Beverages: Rainy days call for cozy sips of warmth and flavor. When the raindrops hit your windowpane, there’s nothing quite like curling up with a cup of your favorite warm drink. Choose from an array of options such as masala chiya, flavored tea, coffee, or hot chocolate. You can pair it with your favorite book or your go-to series at home. If you’re stuck at work, these drinks could provide perfect pick-me-up energy and comfort to power you through the day. Along with comfort, they offer health benefits too. Chamomile, Lavender, and Peppermint teas are known for it’s calming properties making them an excellent choice for the season. Ginger tea, for instance, helps soothe digestion and reduce inflammation, while a cup of herbal tea can ease stress and promote relaxation. Monsoon Snacks: Savor the goodness of rainy-day snacks that pack a punch of flavor. As the rain intensifies, so does the craving for delectable snacks, and a unique and heartwarming trio emerges – the harmonious combination of rain, tea, and deep-fried goods. Indulge in delicious treats like Samosa, Pakora, and Jhol momo. These snacks satisfy your cravings and offer a delightful crunch that pairs perfectly with the sound of rain. While these treats are undoubtedly delicious, moderation is key. Opt for baked or air-fried versions to cut down on excess oil while retaining the flavorful taste. Additionally, include fruits like papaya, watermelon, and strawberries to add a refreshing touch to your snacks. Nutrient-Rich Comfort Meals: Rainy days are an ideal time to relish nourishing comfort foods. This season brings along not only a sense of refreshment but also a potential challenge to our health. It often creates a conducive environment for the growth and spread of various infections, making it crucial to prioritize and bolster our immune system. So it is the perfect opportunity to embrace nutrient-rich comfort meals that warm your soul. Delve into bowls of Steaming hot soups, Noodles, and Thenduk that are brimming with vitamins and minerals. Opt for ingredients like lentils, chickpeas, and leafy greens to boost your immune system and keep illnesses at bay. Consider preparing a hearty vegetable curry or a bowl of Chicken soup to enjoy the monsoon to its fullest. These meals not only provide comfort but also ensure you’re well-nourished as you revel in the rain-soaked ambiance. If you lack cooking inspiration or your go-to spot seems distant, remember that you can always order your favorite meals. So foodies, don’t let the rain get in your way to satisfaction and health. These food items are perfect for savoring the wet season. Foodmandu is all set to deliver your monsoon food cravings to your doorsteps. Log in to the Foodmandu app or website or call us to deliver in Kathmandu Valley & Pokhara. August 17, 2023 (Last Updated: August 18, 2023) By Sohani Dhakal Food Trend Five Dishes That Feel Like Summer June 10, 2022 Food Trend Emerging Start-ups In Nepal With a Bright Future in 2021 November 29, 2020 Food Trend A Message from the Founder November 11, 2020 Current Events Why Contactless Commerce Is the Need of The Hour September 8, 2020 Food Trend Tibetan Cuisines: More than just a Food February 19, 2020 Food Trend Exploring Thai Cuisines February 10, 2020 Food Trend/ Restro-tales The Tales of Newari Taste February 6, 2020 Food Trend Table Etiquette January 31, 2020 Food Trend Medicinal Tips to scare cold away January 12, 2020 Older Posts I want food!!! Click here to place an order Subscribe & Follow Categories Current Events Food Trend Foodmandu Stories Online Food Festival Recipes Restro-tales Recent Post Drenched in Flavor: Wholesome Foods for the Monsoon August 17, 2023 Five Dishes That Feel Like Summer June 10, 2022 Emerging Start-ups In Nepal With a Bright Future in 2021 November 29, 2020 A Message from the Founder November 11, 2020",
      "Copyright 2022 - Foodmandu. All Rights Reserved. Top Designed & Developed by Foodmandu"
    ]
  },
  {
    "url": "https://foodmandu.com/Restaurant/",
    "content": [
      "Restaurants and stores {{city.Name}} {{address.location}} {{ address.location | limitTo: 30 }}{{address.location.length > 30 ? '...' : ''}} {{address.btnMsg}}",
      "Filters Distance Favourites First Alphabetical Order: A-Z Alphabetical Order: Z-A Relevance Filters Cuisine {{tag.Name}} Done Sort By: Distance Favourites First Alphabetical Order: A-Z Alphabetical Order: Z-A Relevance {{item}} No results found with your search criteria. Please try again. {{vendor.ShortName}} {{vendor.Address1}} Approx: {{vendor.Distance}} km {{vendor.CuisineTags}} {{vendor.Name}} {{vendor.Cuisine}} {{vendor.Address}} {{product.Name}} {{product.ProductDesc}} Rs. {{product.OldPrice}} {{product.Price}} No results found!"
    ]
  },
  {
    "url": "https://www.foodmandu.com/Home/TermsAndPrivacy",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/Home/DeliveryCharges",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/FAQs",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/Home/Help",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/page/restaurant-partners",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/Home/AboutUs",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/Help",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/FAQ",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/page/coverage",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/page/payment-options",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/page/refund-policy",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/page/how-to-order",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  },
  {
    "url": "https://www.foodmandu.com/Contact",
    "content": [
      "Order food from the widest range of restaurants. Find Restaurants Find Restaurant",
      "FEATURED RESTAURANTS View all 4 Corners - Detroit Style Pizza Fire And Ice Pizzeria - Thamel The Workshop Eatery - Bakhundole Le Trio - Jhamsikhel Burger Shack - Jawalakhel Koto Restaurant - Durbarmarg Kathmandu Marriott Burger Shack - Kamaladi",
      "About Us Foodmandu is the fastest, easiest and most convenient way to enjoy the best food of your favourite restaurants at home, at the office or wherever you want to. We know that your time is valuable and sometimes every minute in the day counts. That’s why we deliver! So you can spend more time doing the things you love. LEARN MORE",
      "Download the app Always on the go. Food - whenever and wherever you want it!",
      "List your Restaurant at Foodmandu! Reach 2,00,000 + new customers. Send a request"
    ]
  }
]