{
  "page": "https://www.paypal.com/us/legalhub/paypal/buyer-protection",
  "sections": [
    {
      "title": "",
      "type": "text",
      "content": "PayPal's Purchase Protection ProgramQR Code TransactionsItem Not Received ClaimsSignificantly Not as Described ClaimsIneligible Items and TransactionsTransaction Eligibility for PayPal’s Purchase Protection ProgramOnline Dispute Resolution ProcessOpening Disputes: TimeframesDispute with PayPal or Your Card Issuer QR Code TransactionsItem Not Received ClaimsSignificantly Not as Described ClaimsIneligible Items and TransactionsTransaction Eligibility for PayPal’s Purchase Protection ProgramOnline Dispute Resolution ProcessOpening Disputes: TimeframesDispute with PayPal or Your Card Issuer Last updated on September 2, 2025 When you buy something from a seller who accepts PayPal, you may be eligible for a refund under PayPal’s Purchase Protection program, which terms and conditions are set forth herein and form part of the user agreement. When applicable, PayPal’s Purchase Protection program may result in coverage for the full purchase price of the item plus the original shipping costs you paid, if any. PayPal determines, in its sole discretion, whether your claim is eligible for the Purchase Protection program based on the eligibility requirements, any information or documentation provided during the resolution process, or any other information PayPal deems relevant and appropriate under the circumstances. PayPal’s original determination is considered final, but you may be able to file an appeal of the decision with PayPal if you have new or compelling information not available at the time of the original determination or you believe there was an error in the decision-making process. IMPORTANT: You may be required to return the item to the seller or other party we specify as part of the settlement of your claim. PayPal’s Purchase Protection program does not entitle you to coverage for the return shipping costs that you may incur. PayPal’s Purchase Protection program may apply when you encounter these specific problems with a transaction: You didn’t receive your item from a seller (referred to as an “Item Not Received” claim), orYou received an item, but the item isn’t what you ordered (referred to as a “Significantly Not as Described” claim). If you believe that a transaction made through your PayPal account was not authorized by you, this type of claim is different from the Purchase Protection program, and is described below under Liability for Unauthorized Transactions and Other Errors. "
    },
    {
      "title": "QR Code Transactions",
      "type": "text",
      "content": "If you buy something from a seller in person by using a PayPal goods and services QR code, your transaction may be eligible for PayPal’s Purchase Protection program. "
    },
    {
      "title": "Item Not Received Claims",
      "type": "text",
      "content": "Your claim will not qualify for a refund under PayPal’s Purchase Protection program for an Item Not Received claim, if: You collect the item in person, or arrange for it to be collected on your behalf, including if you use PayPal in a seller’s physical store, except for in-person PayPal QR code goods and services transactions, orThe seller has provided proof of shipment or proof of delivery. If the seller presents evidence that they delivered the goods to you, PayPal may find in favor of the seller for an Item Not Received claim even if you claim you did not receive the goods. "
    },
    {
      "title": "Significantly Not as Described Claims",
      "type": "text",
      "content": "An item may be considered Significantly Not as Described if: The item is materially different from the seller’s description of it.You received a completely different item.The condition of the item was misrepresented. For example, the item was described as “new” but the item was used.The item was advertised as authentic but is not authentic (i.e. counterfeit).The item is missing major parts or features and those facts were not disclosed in the description of the item when you bought it.You purchased a certain number of items but didn’t receive them all.The item was damaged during shipment.The item is unusable in its received state and was not disclosed as such. An item may not be considered Significantly Not as Described if: The defect in the item was correctly described by the seller in its description of the item.The item was properly described but you didn’t want it after you received it.The item was properly described but did not meet your expectations.The item has minor scratches and was described as “used.” "
    },
    {
      "title": "Ineligible Items and Transactions",
      "type": "text",
      "content": "The following items or transactions are not eligible for PayPal’s Purchase Protection program: Real estate, including residential property. Vehicles, including, but not limited to, motor vehicles, motorcycles, recreational vehicles, aircraft, and boats, except for personally portable light vehicles used for recreational purposes like bicycles and wheeled hoverboards. Businesses (when you buy or invest in a business). Industrial machinery used in manufacturing. Payments that are equivalent to cash, including stored value items such as gift cards and pre-paid cards. Payments made in respect of gold (whether in physical form or exchange-traded form). Financial products or investments of any kind. Non-fungible tokens (NFTs). Gambling, gaming, and/or any other activities with an entry fee and a prize. Donations, including payments on crowdfunding platforms as well as payments made on crowdlending platforms. Payments to a state-run body (except for state-owned enterprises), government agencies, or third parties acting on behalf of state-run bodies or government agencies. Payments to any bill payment service, including PayPal Bill Pay for Business Accounts transactions. Payments that you initiate via a third-party platform using either the account and routing number assigned to your PayPal Balance account and assigned account and routing number (PayPal's Direct Debit functionality) or the account and routing number assigned to your PayPal business account. Significantly Not as Described claims for wholly or partly custom-made items. Item Not Received claims for physical, tangible items you collect in person or arrange to be collected on your behalf. This includes items bought in a seller’s point of sale location, except if you paid for the transaction in person using PayPal’s goods and services QR code. Anything prohibited by PayPal’s Acceptable Use Policy. Payments made using PayPal Payouts (formerly Mass Pay). Personal Payments including payments sent using PayPal’s friends and family functionality. Payments that you have not sent using your PayPal account. Items intended for resale, including single item transactions or transactions that include multiple items. "
    },
    {
      "title": "Transaction Eligibility for PayPal’s Purchase Protection Program",
      "type": "text",
      "content": "To be eligible for PayPal Purchase Protection you must meet all of the following requirements: Have a PayPal account in good standing. Pay for the eligible item from your PayPal account. Attempt to contact the seller to resolve your issue directly before filing a claim through the Resolution Center. Respond to PayPal’s request for documentation and other information within the time requested. Open a dispute in the Resolution Center within the applicable timeframe and follow our online dispute resolution process. Not have received a recovery or agreed to an alternative resolution related to your purchase from another source. "
    },
    {
      "title": "Online Dispute Resolution Process",
      "type": "text",
      "content": "If you’re unable to resolve a transaction related issue directly with a seller, you must follow our online dispute resolution process through the Resolution Center to pursue a claim under our Purchase Protection program. You may also file a claim (Step 2 below) by calling us and speaking to an agent. The steps you must follow are described below, and if you do not follow these steps your claim may be denied: Step 1: Open a dispute within the applicable timeframe. This might allow you to start a direct conversation with the seller regarding your issue with the transaction that may help resolve the dispute. If you are unable to resolve the dispute directly with the seller, proceed to Step 2. We will place a hold on all funds related to the transaction in the seller’s PayPal account until the dispute is resolved or closed. While we investigate your dispute, in our sole discretion, we may provide a temporary refund. This will allow you to access the funds while your case is under review. If the dispute is resolved in your favor, this refund will become permanent. If the dispute is not resolved in your favor, the refund amount may be recovered as amounts owed to PayPal, which means we may take actions, including but not limited to debiting your PayPal account accordingly. You will receive at least 5 business days' advance notice before any such deduction so that you have the opportunity to ensure sufficient funds are available. Step 2: Escalate the dispute to a claim for reimbursement within 20 days after opening the dispute, if you and the seller are unable to come to an agreement, or we will automatically close the dispute. You can escalate the dispute to a claim for reimbursement through the Resolution Center. The seller or PayPal may also escalate the dispute to a claim at this point. PayPal may ask you to wait at least 7 days from the transaction date to escalate the dispute. Step 3: Respond to PayPal’s requests for documentation or other information, after you, the seller or PayPal escalates your dispute to a claim for reimbursement. PayPal may require you to provide receipts, third-party evaluations, police reports or other documents that PayPal specifies. You must respond to these requests in a timely manner as requested in our correspondence with you. Step 4: Comply with PayPal’s shipping requests in a timely manner, if you’re filing a Significantly Not as Described claim. PayPal may require you, at your expense, to ship the item back to the seller, to PayPal or to a third party (which will be specified by PayPal) and to provide proof of delivery. Proof of delivery means: For transactions that total less than $750 U.S. dollars (or the currency threshold in the table below), confirmation that can be viewed online and includes the delivery address showing at least city/state or zip code, delivery date, and the identity of the shipping company you used. For transactions that total $750"
    },
    {
      "title": "Online Dispute Resolution Process (Part 2)",
      "type": "text",
      "content": "U.S. dollars (or the currency threshold in the table below) or more, you must provide signature confirmation of delivery. If the transaction is in a currency not listed in the table, then signature confirmation is required when the payment exceeds the equivalent of $750 U.S. dollars at the PayPal exchange rate that applies at the time the transaction is processed. Currency Transaction value Currency Transaction value Australian Dollar: 850 AUD New Zealand Dollar: 950 NZD Brazilian Real: 1,750 BRL Norwegian Krone: 4,600 NOK Canadian Dollar: 850 CAD Philippine Peso: 34,000 PHP Czech Koruna: 15,000 CZK Polish Zloty: 2,300 PLN Danish Krone: 4,100 DKK Russian Ruble: 48,000 RUB Euro: 550 EUR Singapore Dollar: 950 SGD Hong Kong Dollar: 6,000 HKD Swedish Krona: 4,950 SEK Hungarian Forint: 170,000 HUF Swiss Franc: 700 CHF Israeli Shekel: 2,700 ILS Taiwan New Dollar: 23,000 TWD Japanese Yen: 77,000 JPY Thai Baht: 24,500 THB Malaysian Ringgit: 3,100 MYR U.K. Pounds Sterling: 450 GBP Mexican Peso: 10,000 MXN U.S. Dollar: 750 USD Step 5: PayPal will make a final decision (including automatically closing any dispute or claim), in its sole discretion, based on the eligibility requirements set forth above, any additional information provided during the online dispute resolution process, or any other information PayPal deems relevant and appropriate under the circumstances. "
    },
    {
      "title": "Opening Disputes: Timeframes",
      "type": "text",
      "content": "Claim Type Timeframe Item Not Received Dispute must be opened within 180 days of the date you sent the payment to the seller. Significantly Not as Described Dispute must be opened (i) within 30 days of the date of delivery or fulfillment (as applicable) of an order or (ii) within 180 days of the date you sent the payment to the seller, whichever is sooner. Unauthorized Transactions and Other Errors Refer to the user agreement for applicable timeframes. "
    },
    {
      "title": "Dispute with PayPal or Your Card Issuer",
      "type": "text",
      "content": "If you used a debit or credit card as the payment method for a transaction through your PayPal account and you are dissatisfied with the transaction, you may be entitled to dispute the transaction with your card issuer. Applicable card chargeback rights may be broader than those available to you under PayPal’s Purchase Protection program. For example, if you dispute a transaction with your card issuer, you may be able to recover amounts you paid for unsatisfactory items even if they don’t qualify for protection under a Significantly Not as Described claim with us. You must choose whether to pursue a dispute with PayPal under our Purchase Protection program, or to pursue the dispute with your card issuer. You can’t do both at the same time or seek a double recovery. If you pursue a dispute/claim with us and you also pursue a dispute for the same transaction with your card issuer, we’ll close your dispute/claim with us. This won’t affect the dispute process with your card issuer. In addition, if you pursue a dispute with your card issuer, you cannot pursue a dispute/claim with us later. If you choose to dispute a transaction with PayPal and we decide against you, you can seek to pursue the dispute with your card issuer later. If PayPal does not make a final decision on your claim until after your card issuer’s deadline for filing a dispute, and because of our delay you recover less than the full amount you would have been entitled to recover from the card issuer, we will reimburse you for the remainder of your loss (minus any amount you have already recovered from the seller or your card issuer). Before contacting your card issuer or filing a dispute with PayPal, you should contact the seller to attempt to resolve your issue in accordance with the seller’s return policy. HelpContactFeesSecurity CenterPrivacy CenterShopAppsEnterprisePartners AboutNewsroomJobsInvestor RelationsGovernment Relations © 1999–2025AccessibilityPrivacy StatementCookiesLegalLicenses PayPal is located at 2211 N 1st St. San Jose, CA 95131 "
    }
  ]
}