{
  "url": "https://help.shopify.com/en/manual/products",
  "category": "manual_products",
  "title": "Products",
  "content": "Contents\nHome\nProducts\n\nThe Products section in your Shopify admin helps you manage your store's entire product catalog, from basic product setup to advanced customization. There are also automation, AI, and bulk management tools that can help you save time when working on your business's product offerings.\n\nOn this page\nFeatures of the Products section\nConnections to other Shopify admin sections\nFeatures of the Products section\n\nAt minimum, a product in Shopify needs to have only two things: A title and a price. From there, you can add descriptions, images, videos. compare-at prices, inventory levels, variants, tags, metafields, and many other details that help you display and sell your products.\n\nProduct details\n\nWhen you add a product to Shopify, you can configure all the relevant settings for your product:\n\nTitle and description: Craft SEO-friendly product names and descriptions using rich text formatting. Avoid duplicate manufacturer descriptions for better search visibility.\nMedia: Upload images, 3D models, or videos to demonstrate products. Supports desktop and mobile layout adjustments and zoom functionality.\nPricing and inventory: Set base prices, track stock quantities, and manage variant-specific inventory.\n\nFor a complete list of details and step-by-step instructions, refer to the product details documentation.\n\nProduct management\n\nAfter you add your products, you can manage them individually or through bulk actions. You can organize them into collections to help apply certain settings to groups of products or display them together on your online store.\n\nReview the following product management actions for more details and instructions:\n\nAdding and updating products\nOrganizing products into collections\nCreating metafields for customized product details\nUsing product tags to group products\n\nYou can also apply certain changes to many products at the same time, such as adjusting prices or changing sales channel visibility using the bulk editor. You can also make changes to your product catalog using CSV files.\n\nConnections to other Shopify admin sections\n\nWhen your product catalog is set up, there are other areas in your Shopify admin that can reference these products to help set up the rest of your store:\n\nInventory and variants: Manage stock levels per variant combination (size and color).\nOnline store menus: Use smart or manual collections to power store menus.\nShipping settings: Create product-based rules for your shipping rates, such as basing them off of product price or weight.\nIn this section\n\nAdding and updating products\n\nManaging inventory\n\nProduct bundles\n\nPurchase options\n\nDigital products\n\nProduct details\n\nVariants\n\nProduct media\n\nCollections\n\nCreating and selling gift cards\n\nImporting and exporting products\n\nCombined listings\n\nSearching for products and filtering your product list\n\nManaging vendor information\n\nDropshipping\n\nTemporarily changing your product line\n\nProduct analytics overview\n\nLeave feedback\nCan’t find the answers you’re looking for? We’re here to help.\nContact Support",
  "scrapedAt": "2025-10-07T10:05:19.006Z"
}
