[
  {
    "id": "doc-1760075027486-5",
    "text": "ContentsHomeOrder management and fulfillmentOrder fulfillment is the entire workflow of processing, fulfilling, managing, and shipping customer orders from your Shopify store. This involves everything from setting up your shipping configuration to sending packages to customers. Whether you're just starting out or you're managing a complex multi-location business, you need to configure your fulfillment settings to ensure that orders reach customers efficiently and cost-effectively.\nBefore you can fulfill orders, you need to set up your shipping and order fulfillment settings, including shipping rates, shipping profiles, and fulfillment locations. These settings determine how shipping costs are calculated at checkout and which locations can fulfill orders. You can create flat shipping rates for predictable pricing, use carrier-calculated rates for accurate real-time pricing, or combine both approaches based on your products and shipping zones.\nAfter customers place orders, you can manage and process them from the Orders page in your Shopify admin. The order management workflow includes capturing payments, reviewing order details, printing shipping documents, and preparing items for fulfillment. You can also edit orders, issue refunds, or cancel orders when needed.\nYou have multiple options for fulfilling orders depending on your business needs. You can fulfill orders individually by handling each order manually, or use bulk fulfillment to process multiple orders at once. For businesses that want to outsource fulfillment, you can work with third-party fulfillment services that integrate with Shopify, or use the Shopify Fulfillment Network for end-to-end logistics support.\nTo save time and money on shipping, you can buy and print shipping labels directly from your Shopify admin. You can also add shipping insurance to protect valuable shipments and provide peace of mind for both you and your customers.\nIf your customer wants to return or exchange items, then you can create and process returns and exchanges directly in your Shopify admin.\nIn this section\nSetting up shipping and order fulfillment\nManaging orders\nFulfilling orders\nFulfillment Network\nGetting started shipping with Shopify\nOverview of order fulfillment and shipping features on Shopify\nLeave feedbackCan’t find the answers you’re looking for? We’re here to help.Contact SupportContact Support",
    "tokens": 597,
    "metadata": {
      "title": "Order management and fulfillment",
      "section": "orders",
      "source": "https://help.shopify.com/en/manual/orders",
      "category": "orders",
      "merchant_level": "beginner",
      "scraped_at": "2025-10-10T05:43:27.182Z",
      "chunk_index": 0
    }
  }
]